{
    "content": [
        {
            "topic": "Misleading Ads",
            "company-size": "small",
            "scenario": "Today, you're excited because there is a pitch meeting. During a pitch meeting, the best of the best of your marketing team pitches new ways to make money! Ope! The meeting is about to start! First up is Alex. Alex has a great idea: advertise products inside of baby registry lists. Right now, Amazon advertises whenever you search in a main page, but they do not advertise inside of wish lists or baby registries. Alex says that adding advertisements to these lists will increase Amagon’s profits by 2%! He shows you some of the advertisements he is thinking about adding to the lists. They look very nice. They seamlessly blend into the content of the baby registry. What do you think? Is this the next big thing in Amagon’s advertising?",
            "choices": [
                "Tell Alex this is a great idea! Why have we never thought of this before?! Moms are very reliable purchasers, especially of baby products, and people are always wanting to buy things for babies and new moms. Send it, Alex!",
                "Hmmm...this makes great business sense, but will people like having ads in their baby registries? Probably not, but people don’t like ads anyway. The ads look great, but people might think they are part of the actually requested items. People really don’t like to be misled. Tell Alex this is a great idea, but the ads need to make clear that they are ads and not products actually requested by the new mom.",
                "No, this is a terrible idea. Amagon would like to get rid of ads completely and move towards a subscription based service. Putting ads in the baby registries would be a backwards step. Tell Alex that this does not line up with Amagon’s business strategy. In fact, maybe Alex should take a break from the pitch meetings."
            ],
            "consequences": [
                "Oh no! There’s a backlash. Because the ads look just like the content requested by new moms, people were misled into buying products the mothers did not request. You did make some profit, but at the expense of angering some consumers. This decision was the egoist action because you were only thinking of your company and not your consumers.",
                "The advertisements are a success! While changing the ads decreased the profits to 1%, that is better than angering consumers and losing their purchasing power. This was the utilitarian action because you helped your company and did not hurt the consumers. In fact, showing them advertisements that were clearly labeled as advertisements may have helped some consumers remember things that they did need!",
                "Kicking Alex out of future pitch meetings resulted in him quitting. Now you’ve lost one of your most creative marketers. Next time, be a little more careful!"
            ]
        },
        {
            "topic": "Treatment of Workers",
            "company-size": "small",
            "scenario": "You realize that most of your developers in your company are working 50hrs/wk and as a result you're able to push out new features and fix bugs super quickly. Every week your company is able to push out new features thanks to the hard work of your employees and is also able to analyze how well these features are doing thanks to your fantastically overworked data analysts. Customers are loving how communicative your company is to their feedback, but your employees are burning out. You decide that you need to do something about this problem. Here are your two choices:",
            "choices": [
                "Keep the same number of work hours, however, you raise everyone's pay by a little bit. You also provide better quality coffee or energy drinks or tea alternatives.",
                "Reduce the number of hours. Your company does not push out new features and bug fixes as quickly as before and as a result you lose some of your customer base."
            ],
            "consequences": [
                "This will result in a 2% reduction in your regular profits. This is more of an egoist tendency because it is a cheap cop-out action from the company.",
                "This results in a 3% reduction in your regular profits. However, your employees are grateful for the friendly work environment and your company begins to attract more talented developers. This decision is utilitarian because it does not only care about the profits of the company, but also the well-being of everyone who makes up the company."
            ]
        },
        {
            "topic": "Partnerships and Associations",
            "company-size": "medium",
            "scenario": "As Amagon continues to grow, more and more companies are requesting to sell their products on Amagon’s site. Because you are trying to grow your company, you usually say yes to these companies because if you have more products to sell, more people will buy products from Amagon. You would like for Amagon to eventually be a one stop shop for people who need to buy almost anything. Recently, you have been working on growing Amagon’s technology department. You have been making deals with computer, camera, and phone companies. These technology companies originate from all over the world, and you are excited that Amagon is beginning to get international attention. You have met many new people from all over the world during this process, however, gaining international attention also requires some extra responsibility. You have to decide how much a voice you will have in other countries and if you have the power and responsibility to deny some companies access to Amagon because of their sketchy dealings. For example, recently an investigative journalist wrote a report about how cameras made by a company called Nikvision were being used by the Russian state police to monitor people. Since the installation of these cameras, the Russian state police have taken more LGBTQ+ people into custody than ever before. This company is currently in the middle of negotiations with Amagon to sell their cameras on Amagon’s site.",
            "choices": [
                "After finding out that there is a correlation between the police’s buying of Nikvision’s cameras and the arrests of LGBTQ+ people, you order your partnership team to halt the negotiations with Nikvision.",
                "While it is terrible that Nikivision’s cameras are being used by some bad actors, this is always the case with any product. Nikvision also decided to give Amagon a larger percentage of all sales. You decide to put out a statement saying that Amagon supports LGBTQ+ people but go forward with the Nikvision partnership."
            ],
            "consequences": [
                "Your halting of this deal with Nikvision leaks to the press and the media portrays this decision as a political stance about LGBTQ+ people’s rights. This positive news coverage and the heightened awareness of Nikvision and the Russian police cause the United States government to look further into Russia’s alleged human rights violations. This is a utilitarian decision since you are caring about the society as a whole and not just the company.",
                "The media sees your statement in favor of LGBTQ+ rights and your partnership with Nikvision as contradictory and call you a hypocrite and all walk, but no talk. This causes some people to protest outside your office. However, as negotiated, Amazon receives a small increase in profits. This is the egoist decision because you chose what was best for you and your company instead of what was better for society."
            ]
        },
        {
            "topic": "Hosting Data for Sketchy Company",
            "company-size": "medium",
            "scenario": "As Amagon grows as a business, it is expanding into new markets. One of these new markets is cloud web hosting. This is a way for other companies to have a website hosted by a secure Amagon  server. Anyone can sign up to have Amagon host their website because Amagon believes in free, open internet. As long as you pay, Amagon will host your website. Most of these websites are company information pages or blogs, however, not all of these companies are completely altruistic. In the news this week, it was reported that a company called Quantier has developed software that gathers data on undocumented immigrants and sells it to the U.S Immigration Customs Enforcement Agency (ICE) to help them start deportation proceedings. One of your employees has alerted you at your morning meeting that Quantier uses Amagon’s cloud web hosting service to host its company’s webpage.  If you decide to ban Quantier from using Amagon’s cloud web hosting service, this will be the first time that Amagon is banning a company from using this service. Since you are just starting to grow this part of Amagon, this would set a precedent that could have major implications for later. Banning Quantier might send a signal to the media and other companies that Amagon censors companies that it disagrees with. Not banning Amagon would show other companies that Amagon is holding firmly to its beliefs about an open service.",
            "choices": [
                "Ban Quantier from using Amagon’s cloud web hosting service. Amagon is concerned that hosting Quantier’s website allows more people and agents to find Quantier and use their data.",
                "Do not ban Quantier from using Amagon’s cloud web hosting service. Amagon is not hosting the actual software or data that Quantier uses, and Amagon does not want to get involved with the politics of ICE."
            ],
            "consequences": [
                "Banning Quantier caused some good and bad press for Amagon. However, as predicted, banning Quantier caused some other companies to decide not to use Amagon’s service. Because ICE was really the only entity using Quantier, banning Quantier from Amagon did not significantly impact how many people were using Quantier’s service. Therefore, this decision did not help Amagon, undocumented immigrants, ICE, or other companies interested in using Amagon’s service. This was not an egoist choice or a utilitarian choice because it did not create good for anyone, including you!",
                "While Amagon receives some bad press for this decision, Amagon does not lose any customers because these customers continue to trust Amagon to not censor their websites. Now Amagon can ensure that these companies’ websites are secure and cannot be hacked. This is an egoist decision that is good for Amagon, but it is also good for other people, most notably the companies that use Amagon’s service. By extension, this is good for the customers of those companies because they can be sure that Amagon will do its best to keep the websites secure. Standing for a freer internet will also be good for the future of Amagon and the future for democracy."
            ]
        },
        {
            "topic": "Interactions with Media",
            "company-size": "medium",
            "scenario": "In order to grow, Amagon wants to advertise its services in the media including popular news websites and cable news. When deciding how to do this, there are a few options. The first option is to purchase ad space on the websites and ad time on the cable news channels and run a commercial or traditional ad for Amagon, advertising with whatever the marketing team at Amagon comes up with. Another option is to donate a large amount of money to an organization or start a new project that would warrant positive media coverage to get free media coverage. You have to decide which way you will advertise Amagon. If you choose to buy traditional ad space, it will cost you $3 million dollars, and if you choose to donate money to an organization, your analysts have determined that you would have to donate $5 million dollars to get a significant enough amount of positive coverage, enough to reach people who are not currently using Amagon.",
            "choices": [
                "Spend $3 million dollars and run ads on cable TV and news websites, This is not harming anyone, and it saves you money! This is a perfectly valid way of advertising that most companies use!",
                "Donate the $5 million dollars to a charity. While this is more expensive, it betters the lives of the people you donated to."
            ],
            "consequences": [
                "This is the egoist decision because it is profitably better for you, and it will not result in any bad news coverage because it is something everyone does.",
                "This is the utilitarian action because it creates the most good for the most people. You still get some advertising, and you are helping people."
            ]
        },
        {
            "topic": "Product Substitution",
            "company-size": "medium",
            "scenario": "A company contacts you asking if they can sell their product on Amagon. This is a routine process where you make sure that the product is legal and a good fit for Amagon. As usual, you call a lawyer to help you with this process. You notice that this product is very similar to a product that Amagon already sells that sells very well. You think that in order to give this new product a leg up, you should list it under the same listing as the product Amagon already sells.",
            "choices": [
                "You ask your lawyer if this is legal. While it does seem somewhat misleading, there must be a loophole that would allow you to do this. Your lawyer finds the loophole. You sell the product under the same listing. After all, it is basically the same product, just made by a different company.",
                "You decide that this company needs to list their product under its own listing. While the products are very similar, they are not exactly the same. You think the consumers should clearly know whether a product is made by company A or company B."
            ],
            "consequences": [
                "Uh oh! The loophole is only acceptable if the products have the same functionality and safety requirements. Turns out this new company’s product is not quite as safe or reliable. There is consumer backlash. Now, some people don’t trust Amagon as much. This is the egoist choice because you did what you thought would make Amagon more money at the expense of not being completely transparent with consumers.",
                "Sadly, the new company’s product never takes off because the previously selling product has a loyal customer base. While you don’t make very much money from the new product, this series of events helps you learn how to list products in a way that helps the consumers and the sellers. This is the utilitarian choice because even though the new company did not benefit as much, the many users of Amagon benefited from transparency and the ability to accurately compare products made by different companies."
            ]
        },
        {
            "topic": "Treatment of Workers",
            "company-size": "medium",
            "scenario": "Your company is expanding rapidly thanks to COVID and now that everyone is more inclined to buy things online than in person. You realize that your company now has the budget to hire more people and the company desperately needs to hire new developers to accomodate for the growing service. You are looking for a new Sr. Project Manager. Two people have applied for the Sr. Project Manager positions:",
            "choices": [
                "Marwan - super talented and young Egyptian male of age 25. has had four years of experience in development. He is however international and it would be a hassle for the HR team to sort out the logistics. However, Marwan is really looking to move to the United States and is in desperate need of a visa. Marwan is also willing to take pretty much any job for any pay so you can easily pay Marwan $130,000/yr which is a good amount of money but still pretty below the average pay of $200,000/yr for senior project managers. If you decide to hire Marwan, you are also planning to provide the leftover $70,000 towards the marketing team because you are quite certain this would boost future profits and brand exposure.",
                "Olivia - a 34 year old woman from Colorado. She's had over seven years of experience developing in the tech industry. Hiring her would be expensive, around $240,000/yr, and it would mean that you would have to switch to a cheaper quality of coffee for all your employees, less cooling in the summer, and less heating in the winter. Employees' lunch budget will also decrease from $18 to $12. The addition of Olivia, however, would mean that it would help unskew the currently majorly male employee atmosphere and she will also be able to provide a new perspective for new future projects which will definitely help understand customers better."
            ],
            "consequences": [
                "This is the egoist option, because the main concern is the company's profits, then the worker or the working environment.",
                "Choosing Olivia is the utilitarian choice because it is a step forward to a more inclusive society."
            ]
        },
        {
            "topic": "Differential Pricing",
            "company-size": "medium",
            "scenario": "Amagon, like any smart company, adjusts the algorithms used to show consumers products. These algorithms are never perfect, and Amagon is always looking for ways to improve them. In order to ensure that Amagon delivers the best user experience possible, Amagon tests these different algorithms on different people. In addition to changing how products are shown on Amagon’s site, Amagon also slightly changes prices to see where the market is at. Today, you received a call from a reporter asking lots of questions about this practice. The reporter says that these tests are not random as they should be. Instead, the reporter accuses Amagon of using demographic data to determine which users will be subjected to the different algorithms and prices. The reporter says that a consumer was offered a different price after deleting their cookies. What do you do?",
            "choices": [
                "Tell the reporter that you are sure that Amagon does not change prices based on consumer demographics. Your policies and oversight would never let that happen. Dismiss this accusation as someone trying to hurt your business.",
                "Tell the reporter that Amagon would never intentionally change prices based on consumer demographics but that you will investigate to see if there was a mistake. Call a meeting of all your engineers and managers to discuss the accusation. Hire an expensive outside investigator to determine if the accusations are true."
            ],
            "consequences": [
                "Oh no! Reporters across the country are reporting similar situations happening. It looks like Amagon did commit questionable or illegal action. You are forced to apologize publicly to save face. This was the egoist action because you did not risk having profits drop earlier by immediately investigating and you did not spend money to hire an investigator.",
                "The investigator finds that the accusations are true, but they were not intentional. You correct the and issue a consumer-wide apology. This was the utilitarian action because you spent money to investigate something that was potentially impacting a lot of people."
            ]
        },
        {
            "topic": "Anti-Competitive",
            "company-size": "large",
            "scenario": "You are selling a publisher's books on your website and taking in 50% of the sale as part of giving them the platform to sell their products. Recently, this publisher began to work with one of your competitors and you know that the competitor will take less of a margin. You are worried about how this publisher will decide to sell their books for some time. You have set prices for this publisher at 9.99 as you know that is the best price to sell to create revenue for your e-reader and everyone has been accepting of this until now. This morning, you find out that this publisher wishes to change your deal and raise the price to 15 dollars as well as only leave you with 30% margin rather than the 50%. You know that the competitor has offered this flexibility to them and that this request comes due to that process.",
            "choices": [
                "Accept their demands.",
                "Strong arm them into not raising their prices as your own revenue will drop with this change and the competitor will be able to take more market share."
            ],
            "consequences": [
                "This choice leads to you losing 10 percent market share in the ebook market which reduces your market share to 30 percent. This results in losses of 20 million and your stock drops by 9%. Your shareholders are not happy with you but in the long term your stocks bounce back and actually increase the morale of your company. You are published in the media positively because you embraced competitors and didn’t shy away. This is utilitarian since, although in the long run, the company benefit from good press, it also is more beneficial to society as a whole.",
                "This choice leads to you keeping your money and market share for the next week, however, soon enough the media is put on alert about it and you get negative press releases that hurt your brand employee moral leading to 5% delay in your products and losses of 10 million. More importantly, the publisher is one of the largest in the space and begins to work even more strongly with the Competitor. Due to this you lose another 5 million. Due to the press releases, delays, and overall outrage by your decisions, the stock drops by 5% of amazon within a month and it doesn’t seem to be bouncing back as the competitor is going to soon release their own product. This is an egoist decision because the only thing you cared about was the success of the company and not the society as a whole."
            ]
        },
        {
            "topic": "Antisemetic Content",
            "company-size": "large",
            "scenario": "Amagon is now the world’s largest ecommerce company. You sell billions of products to billions of people. Companies from all around the world can list their products on Amagon. Unfortunately, this inevitably means that some of the products on Amagon are defective and poorly made. Amagon relies on consumers to downvote products that are poor so that other consumers do not purchase them. Amagon also relies on consumers to decide if a product should not be sold on Amagon for other reasons. While Amagon does have rules and guidelines for sellers, there is simply not enough time or employees to ensure that every product on Amagon meets the rules and guidelines. Recently, media outlets have been reporting on some antisemetic content and products being sold on Amagon. Some consumers are calling for Amagon to ban these products.",
            "choices": [
                "Immediately hire new employees to ensure that all of the antisemetic content is removed from Amagon’s site. This is very expensive, but you believe strongly that Amagon should not list these products.",
                "Let consumers report specific products that they think should not be sold on Amagon. Take down these products as they are reported. At this rate, you don’t have to hire new employees, but the content is taken down much slower."
            ],
            "consequences": [
                "This is the utilitarian action because taking down the content immediately is best for the entire population of consumers. Reducing antisemitic content reduces the number of people that can be radicalized. Unfortunately, it does cost you some money, but that is outweighed by the good of taking down all the content and products. After this incident, other groups are inquiring if Amagon can take down other objectionable content. Now, you must decide whether to keep these employees so they can work on taking down racist, sexist, and other discriminatory products and content.",
                "This is the egoist action because it does require you to spend more money and it satisfies what the consumers were asking for. Because the media reported about this incident, many consumers have started reporting more and more content. Your reporting services are overwhelmed and the backlog is getting quite long."
            ]
        }
    ]
}
