{
    "content": [
        {
            "topic": "Misleading Ads",
            "company-size": "small",
            "scenario": "Today, you're excited because there is a pitch meeting. During a pitch meeting, the best of the best of your marketing team pitches new ways to make money! Ope! The meeting is about to start! First up is Alex. Alex has a great idea: advertise products inside of baby registry lists. Right now, Amagon advertises whenever you search in a main page, but they do not advertise inside of wish lists or baby registries. Alex says that adding advertisements to these lists will increase Amagon’s profits by 2%! He shows you some of the advertisements he is thinking about adding to the lists. They look very nice. They seamlessly blend into the content of the baby registry. What do you think? Is this the next big thing in Amagon’s advertising?",
            "choices": [
                "Tell Alex this is a great idea! Why have we never thought of this before?! Moms are very reliable purchasers, especially of baby products, and people are always wanting to buy things for babies and new moms. Send it, Alex!",
                "Hmmm...this makes great business sense, but will people like having ads in their baby registries? Probably not, but people don’t like ads anyway. The ads look great, but people might think they are part of the actually requested items. People really don’t like to be misled. Tell Alex this is a great idea, but the ads need to make clear that they are ads and not products actually requested by the new mom.",
                "No, this is a terrible idea. Amagon would like to get rid of ads completely and move towards a subscription based service. Putting ads in the baby registries would be a backwards step. Tell Alex that this does not line up with Amagon’s business strategy. In fact, maybe Alex should take a break from the pitch meetings."
            ],
            "consequences": [
                "Oh no! There’s a backlash. Because the ads look just like the content requested by new moms, people were misled into buying products the mothers did not request. You did make some profit, but at the expense of angering some consumers. This decision was the egoist action because you were only thinking of your company and not your consumers.",
                "The advertisements are a success! While changing the ads decreased the profits to 1%, that is better than angering consumers and losing their purchasing power. This was the utilitarian action because you helped your company and did not hurt the consumers. In fact, showing them advertisements that were clearly labeled as advertisements may have helped some consumers remember things that they did need!",
                "Kicking Alex out of future pitch meetings resulted in him quitting. Now you’ve lost one of your most creative marketers. Next time, be a little more careful!"
            ]
        },
        {
            "topic": "Treatment of Workers",
            "company-size": "small",
            "scenario": "You realize that most of your developers in your company are working 50hrs/wk and as a result you're able to push out new features and fix bugs super quickly. Every week your company is able to push out new features thanks to the hard work of your employees and is also able to analyze how well these features are doing thanks to your fantastically overworked data analysts. Customers are loving how communicative your company is to their feedback, but your employees are burning out. You decide that you need to do something about this problem. Here are your two choices:",
            "choices": [
                "Keep the same number of work hours, however, you raise everyone's pay by a little bit. You also provide better quality coffee or energy drinks or tea alternatives.",
                "Reduce the number of hours. Your company does not push out new features and bug fixes as quickly as before and as a result you lose some of your customer base."
            ],
            "consequences": [
                "This will result in a 2% reduction in your regular profits. This is more of an egoist tendency because it is a cheap cop-out action from the company.",
                "This results in a 3% reduction in your regular profits. However, your employees are grateful for the friendly work environment and your company begins to attract more talented developers. This decision is utilitarian because it does not only care about the profits of the company, but also the well-being of everyone who makes up the company."
            ]
        },
        {
            "topic": "Partnerships and Associations",
            "company-size": "medium",
            "scenario": "As Amagon continues to grow, more and more companies are requesting to sell their products on Amagon’s site. Because you are trying to grow your company, you usually say yes to these companies because if you have more products to sell, more people will buy products from Amagon. You would like for Amagon to eventually be a one stop shop for people who need to buy almost anything. Recently, you have been working on growing Amagon’s technology department. You have been making deals with computer, camera, and phone companies. These technology companies originate from all over the world, and you are excited that Amagon is beginning to get international attention. You have met many new people from all over the world during this process, however, gaining international attention also requires some extra responsibility. You have to decide how much a voice you will have in other countries and if you have the power and responsibility to deny some companies access to Amagon because of their sketchy dealings. For example, recently an investigative journalist wrote a report about how cameras made by a company called Nikvision were being used by the Russian state police to monitor people. Since the installation of these cameras, the Russian state police have taken more LGBTQ+ people into custody than ever before. This company is currently in the middle of negotiations with Amagon to sell their cameras on Amagon’s site.",
            "choices": [
                "After finding out that there is a correlation between the police’s buying of Nikvision’s cameras and the arrests of LGBTQ+ people, you order your partnership team to halt the negotiations with Nikvision.",
                "While it is terrible that Nikivision’s cameras are being used by some bad actors, this is always the case with any product. Nikvision also decided to give Amagon a larger percentage of all sales. You decide to put out a statement saying that Amagon supports LGBTQ+ people but go forward with the Nikvision partnership."
            ],
            "consequences": [
                "Your halting of this deal with Nikvision leaks to the press and the media portrays this decision as a political stance about LGBTQ+ people’s rights. This positive news coverage and the heightened awareness of Nikvision and the Russian police cause the United States government to look further into Russia’s alleged human rights violations. This is a utilitarian decision since you are caring about the society as a whole and not just the company.",
                "The media sees your statement in favor of LGBTQ+ rights and your partnership with Nikvision as contradictory and call you a hypocrite and all walk, but no talk. This causes some people to protest outside your office. However, as negotiated, Amagon receives a small increase in profits. This is the egoist decision because you chose what was best for you and your company instead of what was better for society."
            ]
        },
        {
            "topic": "Hosting Data for Sketchy Company",
            "company-size": "medium",
            "scenario": "As Amagon grows as a business, it is expanding into new markets. One of these new markets is cloud web hosting. This is a way for other companies to have a website hosted by a secure Amagon  server. Anyone can sign up to have Amagon host their website because Amagon believes in free, open internet. As long as you pay, Amagon will host your website. Most of these websites are company information pages or blogs, however, not all of these companies are completely altruistic. In the news this week, it was reported that a company called Quantier has developed software that gathers data on undocumented immigrants and sells it to the U.S Immigration Customs Enforcement Agency (ICE) to help them start deportation proceedings. One of your employees has alerted you at your morning meeting that Quantier uses Amagon’s cloud web hosting service to host its company’s webpage.  If you decide to ban Quantier from using Amagon’s cloud web hosting service, this will be the first time that Amagon is banning a company from using this service. Since you are just starting to grow this part of Amagon, this would set a precedent that could have major implications for later. Banning Quantier might send a signal to the media and other companies that Amagon censors companies that it disagrees with. Not banning Amagon would show other companies that Amagon is holding firmly to its beliefs about an open service.",
            "choices": [
                "Ban Quantier from using Amagon’s cloud web hosting service. Amagon is concerned that hosting Quantier’s website allows more people and agents to find Quantier and use their data.",
                "Do not ban Quantier from using Amagon’s cloud web hosting service. Amagon is not hosting the actual software or data that Quantier uses, and Amagon does not want to get involved with the politics of ICE."
            ],
            "consequences": [
                "Banning Quantier caused some good and bad press for Amagon. However, as predicted, banning Quantier caused some other companies to decide not to use Amagon’s service. Because ICE was really the only entity using Quantier, banning Quantier from Amagon did not significantly impact how many people were using Quantier’s service. Therefore, this decision did not help Amagon, undocumented immigrants, ICE, or other companies interested in using Amagon’s service. This was not an egoist choice or a utilitarian choice because it did not create good for anyone, including you!",
                "While Amagon receives some bad press for this decision, Amagon does not lose any customers because these customers continue to trust Amagon to not censor their websites. Now Amagon can ensure that these companies’ websites are secure and cannot be hacked. This is an egoist decision that is good for Amagon, but it is also good for other people, most notably the companies that use Amagon’s service. By extension, this is good for the customers of those companies because they can be sure that Amagon will do its best to keep the websites secure. Standing for a freer internet will also be good for the future of Amagon and the future for democracy."
            ]
        },
        {
            "topic": "Interactions with Media",
            "company-size": "medium",
            "scenario": "In order to grow, Amagon wants to advertise its services in the media including popular news websites and cable news. When deciding how to do this, there are a few options. The first option is to purchase ad space on the websites and ad time on the cable news channels and run a commercial or traditional ad for Amagon, advertising with whatever the marketing team at Amagon comes up with. Another option is to donate a large amount of money to an organization or start a new project that would warrant positive media coverage to get free media coverage. You have to decide which way you will advertise Amagon. If you choose to buy traditional ad space, it will cost you $3 million dollars, and if you choose to donate money to an organization, your analysts have determined that you would have to donate $5 million dollars to get a significant enough amount of positive coverage, enough to reach people who are not currently using Amagon.",
            "choices": [
                "Spend $3 million dollars and run ads on cable TV and news websites, This is not harming anyone, and it saves you money! This is a perfectly valid way of advertising that most companies use!",
                "Donate the $5 million dollars to a charity. While this is more expensive, it betters the lives of the people you donated to."
            ],
            "consequences": [
                "This is the egoist decision because it is profitably better for you, and it will not result in any bad news coverage because it is something everyone does.",
                "This is the utilitarian action because it creates the most good for the most people. You still get some advertising, and you are helping people."
            ]
        },
        {
            "topic": "Product Substitution",
            "company-size": "medium",
            "scenario": "A company contacts you asking if they can sell their product on Amagon. This is a routine process where you make sure that the product is legal and a good fit for Amagon. As usual, you call a lawyer to help you with this process. You notice that this product is very similar to a product that Amagon already sells that sells very well. You think that in order to give this new product a leg up, you should list it under the same listing as the product Amagon already sells.",
            "choices": [
                "You ask your lawyer if this is legal. While it does seem somewhat misleading, there must be a loophole that would allow you to do this. Your lawyer finds the loophole. You sell the product under the same listing. After all, it is basically the same product, just made by a different company.",
                "You decide that this company needs to list their product under its own listing. While the products are very similar, they are not exactly the same. You think the consumers should clearly know whether a product is made by company A or company B."
            ],
            "consequences": [
                "Uh oh! The loophole is only acceptable if the products have the same functionality and safety requirements. Turns out this new company’s product is not quite as safe or reliable. There is consumer backlash. Now, some people don’t trust Amagon as much. This is the egoist choice because you did what you thought would make Amagon more money at the expense of not being completely transparent with consumers.",
                "Sadly, the new company’s product never takes off because the previously selling product has a loyal customer base. While you don’t make very much money from the new product, this series of events helps you learn how to list products in a way that helps the consumers and the sellers. This is the utilitarian choice because even though the new company did not benefit as much, the many users of Amagon benefited from transparency and the ability to accurately compare products made by different companies."
            ]
        },
        {
            "topic": "Treatment of Workers",
            "company-size": "medium",
            "scenario": "Your company is expanding rapidly thanks to COVID and now that everyone is more inclined to buy things online than in person. You realize that your company now has the budget to hire more people and the company desperately needs to hire new developers to accomodate for the growing service. You are looking for a new Sr. Project Manager. Two people have applied for the Sr. Project Manager positions:",
            "choices": [
                "Marwan - super talented and young Egyptian male of age 25. has had four years of experience in development. He is however international and it would be a hassle for the HR team to sort out the logistics. However, Marwan is really looking to move to the United States and is in desperate need of a visa. Marwan is also willing to take pretty much any job for any pay so you can easily pay Marwan $130,000/yr which is a good amount of money but still pretty below the average pay of $200,000/yr for senior project managers. If you decide to hire Marwan, you are also planning to provide the leftover $70,000 towards the marketing team because you are quite certain this would boost future profits and brand exposure.",
                "Olivia - a 34 year old woman from Colorado. She's had over seven years of experience developing in the tech industry. Hiring her would be expensive, around $240,000/yr, and it would mean that you would have to switch to a cheaper quality of coffee for all your employees, less cooling in the summer, and less heating in the winter. Employees' lunch budget will also decrease from $18 to $12. The addition of Olivia, however, would mean that it would help unskew the currently majorly male employee atmosphere and she will also be able to provide a new perspective for new future projects which will definitely help understand customers better."
            ],
            "consequences": [
                "This is the egoist option, because the main concern is the company's profits, then the worker or the working environment.",
                "Choosing Olivia is the utilitarian choice because it is a step forward to a more inclusive society."
            ]
        },
        {
            "topic": "Differential Pricing",
            "company-size": "medium",
            "scenario": "Amagon, like any smart company, adjusts the algorithms used to show consumers products. These algorithms are never perfect, and Amagon is always looking for ways to improve them. In order to ensure that Amagon delivers the best user experience possible, Amagon tests these different algorithms on different people. In addition to changing how products are shown on Amagon’s site, Amagon also slightly changes prices to see where the market is at. Today, you received a call from a reporter asking lots of questions about this practice. The reporter says that these tests are not random as they should be. Instead, the reporter accuses Amagon of using demographic data to determine which users will be subjected to the different algorithms and prices. The reporter says that a consumer was offered a different price after deleting their cookies. What do you do?",
            "choices": [
                "Tell the reporter that you are sure that Amagon does not change prices based on consumer demographics. Your policies and oversight would never let that happen. Dismiss this accusation as someone trying to hurt your business.",
                "Tell the reporter that Amagon would never intentionally change prices based on consumer demographics but that you will investigate to see if there was a mistake. Call a meeting of all your engineers and managers to discuss the accusation. Hire an expensive outside investigator to determine if the accusations are true."
            ],
            "consequences": [
                "Oh no! Reporters across the country are reporting similar situations happening. It looks like Amagon did commit questionable or illegal action. You are forced to apologize publicly to save face. This was the egoist action because you did not risk having profits drop earlier by immediately investigating and you did not spend money to hire an investigator.",
                "The investigator finds that the accusations are true, but they were not intentional. You correct the and issue a consumer-wide apology. This was the utilitarian action because you spent money to investigate something that was potentially impacting a lot of people."
            ]
        },
         {
            "topic": "Anti-Competitive",
            "company-size": "large",
            "scenario": "Your company is growing bigger and bigger. You have hundreds of millions of users and you can pretty much shop for anything on Amagon. Your company now has the resources to make its own products and you decide to start producing very commonly sold items such as branded charging cables. You already know that there are millions of charging cables being sold but most of them are through a smaller manufacturing company called CableWorld that operates through your portal. You have full access to CableWorld's market data (profits made through your portal, item prices, customer service policies, etc.), and you believe this data would be immensely helpful to promoting Amagon's new charging cables. As the CEO, do you take advantage of this information?",
            "choices": [
                "Yes, the best method would be to set the price of your new charging cables at 85% of CableWorld's cables. This way customers will be more attracted to your products over CableWorld's. This would raise credibility of Amagon products but not be very profitable. In fact, you'll actually be losing money by selling your own charging cables, but eventually you'll steal all of CableWorld's customers and once that company goes out of business, you can bump the prices back up again.",
                "No, there is no need to use that information. You can keep the price the same and it will still be beneficial to the company and the economy since the company will be making more profit and at the same time it would promote competitiveness in the market."
            ],
            "consequences": [
                "This is the egoist choice because you are acting in a manner which will only benefit you. When looking at the consequences of your action, the only ones that matter to you are the ones that will affect you, especially when it is in a positive manner.",
                "This is the utilitarian choice because even though you are going to be introducing a new product which will directly compete with this company, you are considering the consequences of your actions in a holistic way and realize that not using their data will lead to creating more good in total compared to using their data, lowering the price, and making them go bankrupt as a result."
            ]
        },
        {
            "topic": "Anti-Competitive",
            "company-size": "large",
            "scenario": "You are in the ecommerce business but also create your own products and sell them through your own site. Since you are in ecommerce, you are currently selling your competitors products as well. However, you have been noticing that their products are beginning to sell more through your own platform. This is beginning to worry you because you’re helping your own competition to sell more than you. One of the members of your advisory board suggests to stop selling their products. After all, it is your ecommerce website. You don’t HAVE to sell their products on it.",
            "choices": [
                "Stop selling their products.",
                "Continue to sell their products on your website."
            ],
            "consequences": [
                "This is an egoist choice. You made this choice because the consequences of the action will be positive for you but didn’t consider how it would impact other people. This choice leads to immediate back fire in the press. As a result your competitors began to stop giving access to their websites and services for all of your products. Their services are some of the most important for your customers and your customers begin to complain and stop buying your products. Your sales plummet and you need to figure out a way to make this money back. You have to let the competitors sell their products again. You reach out to them and they agree to allow access for your customers as well. Ultimately your business achieved nothing but your stock price dropped by 10% due to the lose in new sales.",
                "This choice leads to you eventually losing some market share. However, your market share, at least through your own website, is never actually exceeded by your competitor. There are many other ways that they can buy the product after all so banning the product wasn’t going to be much help. However, you are praised for not being anti-competitive. This choice was the utilitarian choice because you considered the consequences on others not just yourself and this created the most positive outcome for everyone."
            ]
        },
        {
            "topic": "Anti-Competitive",
            "company-size": "large",
            "scenario": "You are selling a publisher's books on your website and taking in 50% of the sale as part of giving them the platform to sell their products. Recently, this publisher began to work with one of your competitors and you know that the competitor will take less of a margin. You are worried about how this publisher will decide to sell their books for some time. You have set prices for this publisher at 9.99 as you know that is the best price to sell to create revenue for your e-reader and everyone has been accepting of this until now. This morning, you find out that this publisher wishes to change your deal and raise the price to 15 dollars as well as only leave you with 30% margin rather than the 50%. You know that the competitor has offered this flexibility to them and that this request comes due to that process.",
            "choices": [
                "Accept their demands.",
                "Strong arm them into not raising their prices as your own revenue will drop with this change and the competitor will be able to take more market share."
            ],
            "consequences": [
                "This choice leads to you losing 10 percent market share in the ebook market which reduces your market share to 30 percent. This results in losses of 20 million and your stock drops by 9%. Your shareholders are not happy with you but in the long term your stocks bounce back and actually increase the morale of your company. You are published in the media positively because you embraced competitors and didn’t shy away. This is utilitarian since, although in the long run, the company benefit from good press, it also is more beneficial to society as a whole.",
                "This choice leads to you keeping your money and market share for the next week, however, soon enough the media is put on alert about it and you get negative press releases that hurt your brand employee moral leading to 5% delay in your products and losses of 10 million. More importantly, the publisher is one of the largest in the space and begins to work even more strongly with the Competitor. Due to this you lose another 5 million. Due to the press releases, delays, and overall outrage by your decisions, the stock drops by 5% of Amagon within a month and it doesn’t seem to be bouncing back as the competitor is going to soon release their own product. This is an egoist decision because the only thing you cared about was the success of the company and not the society as a whole."
            ]
        },
        {
            "topic": "Antisemetic Content",
            "company-size": "large",
            "scenario": "Amagon is now the world’s largest ecommerce company. You sell billions of products to billions of people. Companies from all around the world can list their products on Amagon. Unfortunately, this inevitably means that some of the products on Amagon are defective and poorly made. Amagon relies on consumers to downvote products that are poor so that other consumers do not purchase them. Amagon also relies on consumers to decide if a product should not be sold on Amagon for other reasons. While Amagon does have rules and guidelines for sellers, there is simply not enough time or employees to ensure that every product on Amagon meets the rules and guidelines. Recently, media outlets have been reporting on some antisemetic content and products being sold on Amagon. Some consumers are calling for Amagon to ban these products.",
            "choices": [
                "Immediately hire new employees to ensure that all of the antisemetic content is removed from Amagon’s site. This is very expensive, but you believe strongly that Amagon should not list these products.",
                "Let consumers report specific products that they think should not be sold on Amagon. Take down these products as they are reported. At this rate, you don’t have to hire new employees, but the content is taken down much slower."
            ],
            "consequences": [
                "This is the utilitarian action because taking down the content immediately is best for the entire population of consumers. Reducing antisemitic content reduces the number of people that can be radicalized. Unfortunately, it does cost you some money, but that is outweighed by the good of taking down all the content and products. After this incident, other groups are inquiring if Amagon can take down other objectionable content. Now, you must decide whether to keep these employees so they can work on taking down racist, sexist, and other discriminatory products and content.",
                "This is the egoist action because it does require you to spend more money and it satisfies what the consumers were asking for. Because the media reported about this incident, many consumers have started reporting more and more content. Your reporting services are overwhelmed and the backlog is getting quite long."
            ]
        },
        {
            "topic": "Treatment of Workers",
            "company-size": "large",
            "scenario": "The company now has hundreds of millions of customers to serve and it needs to upsize their delivery facilities so that it can promptly serve every one of their customers. It is becoming increasingly difficult to make sure that every customer receives their orders correctly and on time. With your platform having reached a global scale, you have people from around the world complaining about packages delivered late, defective packages, and workers not treating packages with care. There have been home security camera footage depicting a delivery man simply tossing a package from the front lawn to the doorsteps of one house. You realize that you have to optimize and ensure quality service within the delivery department.",
            "choices": [
                "Start hiring more and more people. It doesn't cost too much to hire new employees anyways, especially now that your company is international. Since there are always people willing to work, threaten your workers to handle customers' packages with care or be fired. If this is not enough to ensure faster delivery dates, you can start overworking your employees with a higher pay.",
                "Start putting more and more money into researching and developing drones and electric vehicle technology. With more modes of transportation customers can start expecting shorter delivery times. This will require hiring of new researchers and this would definitely take a much longer time to be fully in fruition, but once established, your company would have set the standard for delivering packages."
            ],
            "consequences": [
                "The company receives great press for providing more jobs and opportunities for the public. This is a utilitarian decision since society as a whole has benefited: more people got goods more quickly, and more people have jobs now.",
                "Your customers are still not very satisfied with the delivery service since you cannot have your employees immediately operate drones and electric vehicles. They are still waiting on improvements, however, Amagon is now very attractive to new engineers interested in developing new technology. The technology will not only benefit Amagon, but it will revolutionize other delivery services some day. This is a utilitarian decision because it will benefit society as a whole."
            ]
        },
        {
            "topic": "Toxic Work Environment",
            "company-size": "large",
            "scenario": "More and more, it seems inevitable during these times that your company, especially in the higher levels, is mostly full of men. You never really interfered with how the company's culture developed--your main value that you always emphasized is to put customers first, before everything else. Unfortunately, as a result of being unchecked, the company grew to have a hostile working environment for people of minority, especially towards women and those representing LGBTQ+. Recently, there was a big scandal that went public, involving several of the higher executives and countless anecdotes of unwanted approaches. You have just heard about this news when it went public and now have to deal with these problems as well as saving the company from international shame.",
            "choices": [
                "You want the news to die down. The company is planning on releasing new products in the next couple weeks and this bad press cannot be good for the launch. You decide to pay off some people in the news networks, but you also offer large sums of money and apologies from the executives to the victims of harassment. You will also leave a stern memo to the executives involved and make sure they understand not to do such things again.",
                "You decide to do something to change the atmosphere of the company. You announce to the news that Amagon will be actively hiring more women executives and start establishing inclusion workshops to make the company feel more safe. You also establish a forum where anybody can anonymously report an incident that they find is concerning."
            ],
            "consequences": [
                "Your new product launch does really well! The general public has forgotten what has happened within the company, and most of the victims are satisfied with their financial compensation. You feel great that your memo seems to have worked since you haven't really heard of any new incidents in three months. This is an Egoist decision because you only really cared about the face of the company and everyone else on a superficial level.",
                "The productivity level in your company has severely dropped due to most of the employees doing programs within the workshop and trying to get used to the new environment and atmosphere. You're not sure how effective the new measures are, but at least the public is proud and happy that you have put forth these new measures within Amagon. This is a Utilitarian decision because the main thing you were concerned about was the employees in the company, not just the results of the company and its profit margins."
            ]
        },
        {
            "topic": "Sustainability",
            "company-size": "large",
            "scenario": "Because the company is serving millions of customers, the amount of plastic waste and styrofoam packing peanuts generated from packaging goods is amounting to tons. No one outside the company has noticed this yet and you were just notified of this fact through a recent sustainability report since your company just loves to horde all different kinds of data. Some of your employees who worked on to produce the report express their concerns for the growing waste due to the various delivery services.",
            "choices": [
                "You decide that polluting the environment is absolutely unacceptable and immediately ask for new projects to reduce waste generated by the company services.",
                "This news is far from hitting the media yet so you let this problem sit. The money and resources that would be used to reduce waste can be allocated to more pressing matters at hand like improving its web services so that it can compete with Doogle's web services."
            ],
            "consequences": [
                "This is an utilitarian decision. Your efforts greatly helped the environment and the world thanks the company for making such a decision. Your company receives very good press and customers have increased their trust in the company.",
                "This is an egoist decision. Just because people are not aware of the problem does not mean that it does not exist. A couple months later, the public eventually finds out that the company has known about the accumulating waste in the environment for a while and has not done anything about it yet. Some groups of people decide they will boycott and protest against the company."
            ]
        },
        {
            "topic": "Taxes",
            "company-size": "small",
            "scenario": "Because Amagon is such a small company, you have to wear many hats. Some days you have to refill the water coolers. Other days you are calling your partners. And still other days, you are doing what you are doing today - boring business stuff like taxes. Sadly, business taxes are a lot more complicated than individual taxes. You have to sift through laws and regulations to determine what is tax-deductible and what you can write-off. As you are reading through one of the laws, you notice a loophole that would allow you to save a small amount of money.",
            "choices": [
                "You decide to take the loophole and save the money. You reinvest the money into your growing company.",
                "You decide to not take the loophole and pay the small amount of taxes that you could have saved."
            ],
            "consequences": [
                "With the money you saved from the tax loophole, you decide to give your hardest working employees a raise. They deserve to be recognized for their great work. This was the utilitarian decision because you were thinking of maximizing good for a number of people.",
                "By paying the taxes, you are ensuring that you are following the spirit of the law. No one in the future can say that you were trying to avoid paying taxes. You were looking out for future you. This was the egoist decision because you were thinking more about yourself than others."
            ]
        },
        {
            "topic": "Your Personal Wealth",
            "company-size": "large",
            "scenario": "Amagon has grown to be one of the largest and most profitable companies of all time. You are now the wealthiest person on the planet with a net worth of $200 billion dollars. This is equivalent to the GDP of Qatar. People have been asking for a long time about what you are going to do with that money.",
            "choices": [
                "Start giving away all of it to philanthropic organizations. Invest in climate change efforts, world hunger, world poverty, etc.",
                "Invest this money in areas that are too expensive for governments to invest in like going to Mars and developing robots."
            ],
            "consequences": [
                "Many charity organizations are very happy about your donations. The media does some positive stories about your philanthropy. This is the utilitarian action because you are helping produce good for many people.",
                "Your investments in these areas help innovation immensely. In fact, a mission to Mars is going to launch tomorrow. The consequences of this decision are hard to measure, so this could be considered a utilitarian action or neither utilitarian or egoist."
            ]
        },
        {
            "topic": "Headquarters Bidding",
            "company-size": "large",
            "scenario": "Amagon has grown into a huge company. It is now large enough that a second headquarters is needed. You have announced that you are accepting bids from different cities to determine where to build your second headquarters. This new headquarters will create thousands of jobs in whichever city you choose to build in. You have received bids from over 200 cities. Your experts have come up with a set of criteria to narrow down which city will be the new spot for your headquarters. Which criteria will you choose?",
            "choices": [
                "Choose the city that has the most lenient tax rules and most lenient environmental regulations.",
                "Choose the city with the highest bid."
            ],
            "consequences": [
                "Using this criteria to narrow down cities leaves you with cities that have a very hands-off approach. Some of the people that transfer to this new headquarters are not happy with this kind of government and choose to leave the company. This is an egoist choice because you were only thinking about what is best for your business and not what is best for everyone. If you were thinking about what was best for everyone, you would have considered that the large amount of taxes that Amagon pays could significantly help a community and that because of Amagon’s huge environmental impact, you want to reduce the negative effects as much as possible because everyone is affected by climate change.",
                "Using this criteria to narrow down cities leaves you with cities with very high prices on everything. This means that you have to pay your employees in this new headquarters significantly more. This is an egoist action because you were only thinking about how the bid could help your company and not the larger society or greater number of people."
            ]
        },
        {
            "topic": "Environmental Impact",
            "company-size": "large",
            "scenario": "Today, the leader of your HR department informed you that a large group of your employees has organized an Amagon Employees for Climate Justice group. This group plans to walk out on their jobs tomorrow in protest of Amagon’s climate policies. They say that Amagon uses too many fossil fuels and funds lobbyists that spread climate denialism. They demand that Amagon reaches zero emissions in 10 years and redirects all of the funding that they were using to fund climate denialist lobbyists to fund climate change proposals. You know that cutting ties with fossil fuel would be bad for Amagon’s stocks and investors, however, you know that in the future, you will have to answer how fast Amagon made the switch to zero emissions. You have a couple choices.",
            "choices": [
                "Put out a statement ahead of the protests that you are very proud of this Amagon Employees for Climate Justice Group. In the statement, you say that you would love to work out a plan to meet their demands.",
                "Fire all of the members of the Amagon Employees for Climate Justice Group. You are not ready to lose out on fossil fuel money just yet."
            ],
            "consequences": [
                "The media applauds you for this brave action. You are invited to talk to many reporters. Now, that you have said this to the media, you must create a team to create a plan for Amagon’s future climate action. This is the utilitarian action because climate change affects many more people than the shareholders in your company.",
                "The employees that you fire decide to sue you. You are forced into lawsuits that you do not want to be in. This is the egoist action because you were more concerned about what was going to happen to your business and money than you were about the billions of people who are affected by climate change."
            ]
        },
        {
            "topic": "Amagon Reviews",
            "company-size": "large",
            "scenario": "Amagon loves its customers, and Amagon wants to make sure that their customers get the best products at the best prices. This is why Amagon, like so many other sites that provide a service (like youtube and yelp) allow users to post reviews of the things that they buy. Reviews help consumers determine how clothing fits, how well products work, and if products last a long time (in addition to other useful information). Amagon sees reviews as customer service. Unfortunately, recently there have been many news stories concerning reviews that were not posted in good faith. These reviews include book reviews by the author that wrote the book or employees of a competitor company trashing their competitors product for no good reason. You have to decide how to handle this situation.",
            "choices": [
                "Discontinue reviews! This is a public relations nightmare! You are tired of the stories about corrupt Amagon reviews. Besides, this will save Amagon money because if there are no more reviews, you will not have to pay for people to develop that feature of your website.",
                "While people will always find ways around the system and rules, you believe that Amagon can do more to encourage good reviews from reputable sources. You decide to create a team of people that will implement a system that will determine how trustworthy a review is based on natural language processing and previous activity of the user. This solution takes a while to implement."
            ],
            "consequences": [
                "After discontinuing all reviews, customers find it more difficult to determine which products to buy. Though the PR nightmare about the corrupt reviews disappears, now there are stories about this bad decision by Amagon. This is the egoist action because you only thought about how your decision would impact your business and not about how it would affect your consumers (a larger number of people).",
                "After your solution was revealed, your internal team has determined that there was a decrease of published corrupt reviews. They also saw that there were less attack-like reviews on your platform. This was the utilitarian decision because you thought about how your decision would impact everyone and decided that it would have a greater benefit on more people than the potential small benefit to your business."
            ]
        },
        {
            "topic": "Animal Cruelty",
            "company-size": "medium",
            "scenario": "Amagon began as a bookstore company and due to this you are well aware that there are many books,magazines, e-books etc. that you will most likely never know are being sold on Amagon. Just for fun some of your employees like to look at the newly listed items that appear on Amagon and see what is currently being utilized. One of them finds that there is a cockfighting magazine that has just been added as a product for Amagon. He flagged it to his superior, who in turn flagged it to his superior, and so on until it eventually made it to you in a board meeting. What should you do about this?",
            "choices": [
                "Keep the magazine. After all you didn’t put it on Amagon or make it. You just distribute it. Besides, you most likely wouldn’t have ever known it was there if iit wasn't for this employee randomly finding it. Don’t shoot the messenger am I right?",
                "Take it down immediately. You realize that having it on your website is no doubt going to draw some negative attention if it gets out. Besides, it’s animal cruelty."
            ],
            "consequences": [
                "This was the egoist choice. You thought the profit was better than the possibility of the negative results. The media got news that you were distributing this website and they did not take it well. Apparently they did shoot the messenger because you end up in court having a lawsuit filed against you. The negative media coverage, the cost of lawyers, and the need for you to take off time from work to deal with this mess ends up costing you a 10% drop in stock, which your board of directors is not happy about, and about 10 million dollars. That was definitely not worth it.",
                "This is the utilitarian choice. By taking it down immediately you didn’t make some money but you helped to stop the spread of this website on a large platform. Because you didn;t let them do this they don’t increase their operations hurting more animals."
            ]
        },
        {
            "topic": "Influence Over Local News",
            "company-size": "large",
            "scenario": "There is an ongoing pandemic called Covid-20 (no relation to Covid-19) that is currently spreading through the nation. You have tried to implement measures to keep your workers safe during the pandemic, however, business is better than ever and you couldn’t shut everything down. People are depending on Amagon to deliver their products. You have done something and that’s what counts. You hear that some news channels are going to talk about Amagon’s performance with Covid-20 and the way that Amagon handled it. You’re not sure if they will be as lenient and understanding on your response as you have been and are curious what you could do to make sure they talk about things in a positive light. One of the executives mentions that you may be able to sent a package with a video that gives an insider look at the response. Of course, this will be recorded by one of the HR managers and will get some positive views on what is going on. This would make the news’ job easier as they all were going to have to conduct this research anyway. Should you go ahead with the plan?",
            "choices": [
                "Go ahead",
                "Hope that they will air some positive news about you without sending this video to them."
            ],
            "consequences": [
                "You send the package and everything is going well for you. It looks like all of the new stations that you reached out to are doing what you wanted. That is until the last one. This person talks about how they received the package and it was not received well. They think you are spreading false propaganda. Your shareholders are furious with you because people boycott Amagon and your sales decrease by 10%. This was the egoist choice because getting the truth out would have led to reforms and several employees begin to test positive, causing them to incur large health bills. This decision was great for you but not for anyone else.",
                "You wait it out and it’s about 50/50 about how you have handled the situation. Ultimately it looks like some people think you’ve been doing well and others don’t. You didn’t lose anything but didn’t gain anything either. To address the negatives, you create some reforms and help save people from catching the virus."
            ]
        },
        {
            "topic": "Product Replacement",
            "company-size": "large",
            "scenario": "Since your company works with various suppliers, you are able to offer the same product at a much larger scale. If one of your suppliers runs out of supplies, you can easily replace it with another supplier. This is just like when companies order a lot of meat from different farms or similar formats like that. Something that is brought to your attention is that the products that you were selling as equal are actually quite different and come from different countries. This means that they are not evaluated under the same amount of rigorous testing. You realize that this is a problem but at the same time not many people are going to be able to tell. Should you look into separating the products out depending on where/by who they are being sold or leave it as is?",
            "choices": [
                "Leave it as is and don’t waste the time.",
                "Make this into a large scale project."
            ],
            "consequences": [
                "Since you leave it as is, there is an incident. It looks like the difference in safety and even features was quite large for the commodity products that you tried to sneak through as equals. You have to pay damages to the customers that ordered these products and invest the money in the large scale project. This was the egoist choice because you prioritized profits (a benefit to you) over being a good company and the benefits to everyone else. It was the biggest benefit to you.",
                "You went ahead and invested the time into the project. You are glad you did because your competitor had a similar structure to you but didn’t end up changing his method of selling similar products. He has the scandal blow up and you start getting good media coverage as you are an example to follow. This is the utilitarian choice because you acted in a manner that created the most good in total (in this case for all your customers)."
            ]
        },
        {
            "topic": "Counterfeit Products",
            "company-size": "large",
            "scenario": "You sell a large amount of products and you don’t really verify that the products are actually what they say they are.. You start to think you should probably check that out. You are selling the products on your website through third party sellers but also assuming they are legitimate so selling them through your own warehouse as well. You’re pretty sure people wouldn't do that because well what's the benefit? Besides, it would cost you a lot of money to fix that! Regardless you feel like maybe you should go and check it out.",
            "choices": [
                "Assume that the sellers are true to their word and live life peacefully.",
                "Go figure out if the pear products are actually coming from the pear company."
            ],
            "consequences": [
                "Well. It looks like those products were definitely counterfeit. Your partner companies are angry with you and you manage to get off the hook since you were being deceived as well. They are angry that you didn’t check though, and the way they found out was by running their own tests. This was the egoist action since you only considered how it would affect you. For you, it brought in profit but others are upset that they were being deceived. The partner relationships with these companies are hurt due to your actions and your customers not too happy either.",
                "Well. It looks like those products were definitely counterfeit. Once you figure this out you decide to crack down on it and inform the companies whose products were being counterfeited. They are certainly angry but not at you. Your partner relationships become stronger with these companies because you have shown them that you are on their side and prioritize the well being of commerce over your own motives. This is the utilitarian choice because you didn’t act with only your own interest in mind but saw what would create the most good for everyone and took that approach. The customers are happy you are not deceiving them and so are these companies that have worked so hard to protect their products."
            ]
        },
        {
            "topic": "Minimum Wage",
            "company-size": "large",
            "scenario": "Research shows that the average living expense from this decade is much higher than in previous decades yet the minimum wage has not grown with it. This technically means that people have to work much much more than before to have the same basic necessities. However, you are an old timer, so this seemed like not an issue to you. Regardless, you think that perhaps you may want to raise it. This would certainly make your employees happier and allow for them to work less, but your bottom line is going to take a huge hit.",
            "choices": [
                "Raise the minimum wage.",
                "Keep it as is."
            ],
            "consequences": [
                "This is the utilitarian choice. Paying your employees more would allow for them to have to work less and make them much happier from spending more time with family, being able to live more comfortably etc. This actually ends up making them more productive as well! Despite this not being a great option for you, It brings the most net happiness for the other stakeholders (in this case, your employees).",
                "This is the egoist choice. Keeping the wage as it is brings you the most good because you don’t lose money. You are acting in a way that will benefit you the most but not considering how much good it would bring others."
            ]
        }
    ]
}
